CSI API ETABS v1
cAnalysisResults.GeneralizedDispl Method
 Reports the displacement values for the specified generalized displacements
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GeneralizedDispl(
	string Name,
	ref int NumberResults,
	ref string[] GD,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref string[] DType,
	ref double[] Value
)
Function GeneralizedDispl (
	Name As String,
	ByRef NumberResults As Integer,
	ByRef GD As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef DType As String(),
	ByRef Value As Double()
) As Integer
Dim instance As cAnalysisResults
Dim Name As String
Dim NumberResults As Integer
Dim GD As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim DType As String()
Dim Value As Double()
Dim returnValue As Integer
returnValue = instance.GeneralizedDispl(Name,
	NumberResults, GD, LoadCase, StepType,
	StepNum, DType, Value)
int GeneralizedDispl(
	String^ Name,
	int% NumberResults,
	array<String^>^% GD,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<String^>^% DType,
	array<double>^% Value
)
abstract GeneralizedDispl :
        Name : string *
        NumberResults : int byref *
        GD : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        DType : string[] byref *
        Value : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing generalized displacement for which results are returned.
 If the program does not recognize this name as a defined generalized displacement, it returns results for all selected generalized displacements, if any. For example, entering a blank string (i.e., "") for the name will prompt the program to return results for all selected generalized displacements
NumberResults
Type: System.Int32
 The total number of results returned by the program
GD
Type: System.String[]
 This is an array that includes the generalized displacement name associated with each result
LoadCase
Type: System.String[]
 This is an array that includes the name of the analysis case or load combination associated with each result
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result
StepNum
Type: System.Double[]
 This is an array that includes the step number, if any, for each result
DType
Type: System.String[]
 This is an array that includes the generalized displacement type for each result. It is either Translation or Rotation
Value
Type: System.Double[]
 This is an array of the generalized displacement values for each result. [L] when DType is Translation , [rad] when DType is Rotation
Return Value
Type: Int32
 Returns zero if the displacements are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberResults As Integer
       Dim GD() As String
       Dim LoadCase() As String
       Dim StepType() As String
       Dim StepNum() As Double
       Dim DType() As String
       Dim Value() As Double
       Dim SF() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("DEAD")
   'add generalized displacement
       ret = SapModel.GDispl.Add("GD1", 1)
   'add point to generalized displacement
       ReDim SF(5)
       SF(0) = 0.5
       ret = SapModel.GDispl.SetPoint("GD1", "3", SF)
   'get generalized displacement results
       ret = SapModel.Results.GeneralizedDispl("GD1", NumberResults, GD, LoadCase, StepType, StepNum, DType, Value)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace